Revit 2025 API
AlignedFreeFormSetOrientationOptions Enumeration
 Orientation options for Aligned Free Form Rebar set.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum AlignedFreeFormSetOrientationOptions
Public Enumeration AlignedFreeFormSetOrientationOptions
public enum class AlignedFreeFormSetOrientationOptions
type AlignedFreeFormSetOrientationOptions
Members
Member name | Value | Description
AlignedToDistributionPath | 0 |  Cutting planes are perpendicular to the distribution path.
Vertical | 1 |  Cutting planes are oriented vertically, X or Y vector being Z axis.
ParallelToFace | 2 |  Cutting planes are parallel to a selected planar face.
PerpendicularToFace | 3 |  Cutting planes are oriented perpendicular to a selected planar face, X or Y vector being the face normal.
See Also
Reference
Autodesk.Revit.DB.Structure Namespace